TEST_MESSAGES = [
    """Пахота зяби под мн тр
По Пу 26/488
Отд 12 26/221

Предп культ под оз пш
По Пу 215/1015
Отд 12 128/317
Отд 16 123/529

2-е диск сах св под пш
По Пу 22/627
Отд 11 22/217

2-е диск сои под оз пш
По Пу 45/1907
Отд 12 45/299""",

    """Пахота зяби под сою
По ПУ 7/1402
Отд 17 7/141

Вырав-ие зяби под кук/силос
По ПУ 16/16
Отд 12 16/16

Вырав-ие зяби под сах/свёклу
По ПУ 67/912
Отд 12 67/376

2-ое диск-ие сах/свёкла
По ПУ 59/1041
Отд 17 59/349""",

    """12.10
Внесение мин удобрений под оз пшеницу 2025 г ПУ Юг 149/7264
Отд 17-149/1443""",

    """Север
Отд7 пах с св 41/501
Отд20 20/281 по пу 61/793
Отд 3 пах подс.60/231
По пу 231

Диск к. Сил отд 7. 32/352
Пу- 484
Диск под Оз п езубов 20/281
Диск под с. Св отд 10 83/203 пу-1065га""",

    """Внесение удобрений под рапс отд 7 -138/270
Дисклвание под рапс 40/172
Диск после Кук сил отд 7-32/352 по пу 484га""",

    """10.03 день
2-я подкормка озимых, ПУ "Юг" - 1749/2559
(в т.ч Амазон-1082/1371
Пневмоход-667/1188)

Отд11- 307/307 (амазон 307/307)

Отд 12- 671/671( амазон 318/318; пневмоход 353/353)

Отд 16- 462/1272( амазон 148/437; пневмоход 314/835)

Отд 17- 309/309( амазон 309/309)""",

    """Уборка свеклы 27.10.день
Отд10-45/216
По ПУ 45/1569
Вал 1259680/6660630
Урожайность 279,9/308,3
По ПУ 1259680/41630600
На завод 1811630/6430580
По ПУ 1811630/41400550
Положено в кагат 399400
Вввезено с кагата 951340
Остаток 230060
Оз-9,04/12,58
Дигестия-14,50/15,05""",

    """Пахота под сах св
По Пу 77/518
Отд 12 46/298
Отд 16 21/143
Отд 17 10/17

Чизел под оз ячмень
По Пу 22/640
Отд 11 22/242

Чизел под оз зел корм
Отд 11 40/40

Диск оз пшеницы
По Пу 28/8872
Отд 17 28/2097

2-е диск под сах св
По Пу 189/1763
Отд 11 60/209
Отд 12 122/540
Отд 17 7/172

Диск кук силос
По Пу 6/904
Отд 11 6/229

Прик под оз ячмень
По Пу 40/498
Отд 11 40/100

Уборка сои (семенной)
Отд 11 65/65
Вал 58720
Урож 9""",

    """Пахота под сах св
ПоПу 91/609
Отд 11 13/73
Отд 12 49/347
Отд 16 20/163
Отд 17 9/26

Чизел под оз зел корм
Отд 11 60/100

2-е диск под сах св
По Пу 53/1816
Отд 12 53/593

Диск кук силос
По Пу 66/970
Отд 11 66/295

Диск сах св
Отд 12 13/13

Прикат под оз ячмень
По Пу 40/538
Отд 11 40/140

Уборка сои семенной
Отд 11 29/94
Вал 37400/96120
Урож 12,9/10,2""",

    """Пахота под сах св
По Пу 88/329
Отд 11 23/60
Отд 12 34/204
Отд 16 31/65

Пахота под мн тр
По Пу 10/438
Отд 17 10/80

Чизел под оз ячмень
По Пу 71/528
Отд 11 71/130

2-e диск под сах св
По Пу 80/1263
Отд 12 80/314

2-e диск под оз ячмень
По Пу 97/819
Отд 17 97/179

Диск кук силос
По Пу 43/650
Отд 11 33/133
Отд 12 10/148

Выкаш отц форм под/г
Отд 12 10/22

Уборка сах св
Отд 12 16/16
Вал 473920
Урож 296,2
Диг - 19,19
Оз - 5,33""",

    """20.11 Мир
Пахота зяби под сою 100 га день, 1109 га от начала, 97%, 30 га остаток.
Работало 4 агрегата.
Выравнивание зяби под подсолнечник 47 га день, 141 га от начала, 29 %, остаток 565 га. Работал 1 агрегат

Осадки:
Бригада 1 Воронежская - 6 мм""",

    """ТСК
Выравнивание зяби под сою 25 га/ с нарастающим 765 га ( 13%) Остаток 5332 га
Выравнивание зяби под кукурузу 131га (3%) Остаток 4486 га
Осадки 1мм""",

    """Восход
Посев кук-24/252га
24%
Предпосевная культ
Под кук-94/490га46%
СЗРоз пш-103/557га
25%
Подкормка оз рапс-
152га , 100%, подкормка овса-97ga, 50%
Довсходовое боронование подсолнечника-524
га, 100%."""
] 